---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.TooManyAreaBoundaryLinesFound
source: html/92bd9600-db50-0b61-8745-f8e371fb9afd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.TooManyAreaBoundaryLinesFound Property

There are too many area boundary lines in area scheme <element> might result in increased model sizes on disk and in memory. Please investigate if area scheme is used in a proper way.

## Syntax (C#)
```csharp
public static FailureDefinitionId TooManyAreaBoundaryLinesFound { get; }
```